missing-paws/app/views/articles/index.html.erb

  <div class='author'>
    Crated by <%= User.find(article.user_id).name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]