missing-paws/app/controllers/adoptions_controller.rb

  def index
    if params[:search]
      @adoptions = Adoption.search(params[:search]).order("created_at DESC")
---
SELECT "adoptions".* FROM "adoptions" WHERE (title LIKE '%cats%' OR city LIKE '%cats%' OR description LIKE '%cats%')  ORDER BY created_at DESC

  def create
    #@adoption = Adoption.new(adoption_params)
    @lost_animal = current_user.adoptions.build(adoption_params)

    respond_to do |format|
      if @adoption.save
---
INSERT INTO "adoptions" ("title", "description", "image_url", "name", "phone", "email", "city", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @adoption.update(adoption_params)
---
UPDATE "adoptions" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "adoptions"."id" = ?  [["title", "Dog for adoption. Urgent!"], ["description", "This super-sweet dog is waiting for you to adopt it!"], ["updated_at", "2015-08-12 09:39:54.093468"], ["id", 1]]

  def destroy
    @adoption.destroy
---
DELETE FROM "adoptions" WHERE "adoptions"."id" = ?  [["id", 4]]

    def set_adoption
      @adoption = Adoption.find(params[:id])
---
SELECT  "adoptions".* FROM "adoptions" WHERE "adoptions"."id" = ? LIMIT 1  [["id", 4]]