missing-paws/app/controllers/animal_shelters_controller.rb

SELECT "animal_shelters".* FROM "animal_shelters"
---
  def index
    @animal_shelters = AnimalShelter.all

INSERT INTO "animal_shelters" ("title", "description", "image_url", "phone", "website", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @animal_shelter = AnimalShelter.new(animal_shelter_params)

    respond_to do |format|
      if @animal_shelter.save

UPDATE "animal_shelters" SET "city" = ?, "updated_at" = ? WHERE "animal_shelters"."id" = ?  [["city", "Sofia"], ["updated_at", "2015-08-13 16:28:30.413469"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @animal_shelter.update(animal_shelter_params)

SELECT  "animal_shelters".* FROM "animal_shelters" WHERE "animal_shelters"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_animal_shelter
      @animal_shelter = AnimalShelter.find(params[:id])