missing-paws/app/controllers/articles_controller.rb

  def index
    if params[:search]
      @articles = Article.search(params[:search]).order("created_at DESC").paginate(page: params[:page], per_page: 10)
---
SELECT "articles".* FROM "articles"  ORDER BY created_at DESC

  def create
    @article = current_user.articles.new(article_params)


    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "content", "image", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)