missing-paws/app/controllers/found_animals_controller.rb

  def index
    if params[:search]
      @found_animals = FoundAnimal.search(params[:search]).order("created_at DESC")
---
SELECT  "lost_animals".* FROM "lost_animals"  ORDER BY created_at DESC LIMIT 1
SELECT "found_animals".* FROM "found_animals" WHERE (title LIKE '%dog%' OR city LIKE '%dog%' OR description LIKE '%dog%')  ORDER BY created_at DESC

  def create
    @found_animal = current_user.found_animals.build(found_animal_params)

    respond_to do |format|
      if @found_animal.save
---
INSERT INTO "found_animals" ("title", "description", "image_url", "name", "phone", "email", "city", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @found_animal.update(found_animal_params)
---
UPDATE "found_animals" SET "title" = ?, "updated_at" = ? WHERE "found_animals"."id" = ?  [["title", "Found a tiger dog"], ["updated_at", "2015-08-17 09:44:58.977957"], ["id", 4]]

    def set_found_animal
      @found_animal = FoundAnimal.find(params[:id])
---
SELECT  "found_animals".* FROM "found_animals" WHERE "found_animals"."id" = ? LIMIT 1  [["id", 4]]