missing-paws/app/controllers/lost_animals_controller.rb

  def index
    if params[:search]
      @lost_animals = LostAnimal.search(params[:search]).order("created_at DESC")
---
SELECT  "lost_animals".* FROM "lost_animals"  ORDER BY created_at DESC LIMIT 1

  def create
    @lost_animal = current_user.lost_animals.build(lost_animal_params)

    respond_to do |format|
      if @lost_animal.save
---
INSERT INTO "lost_animals" ("title", "description", "image_url", "name", "phone", "email", "city", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @lost_animal.update(lost_animal_params)
---
UPDATE "lost_animals" SET "title" = ?, "updated_at" = ? WHERE "lost_animals"."id" = ?  [["title", "My cute dog is gone"], ["updated_at", "2015-08-17 09:41:57.008165"], ["id", 4]]

  def destroy
    @lost_animal.destroy
---
DELETE FROM "lost_animals" WHERE "lost_animals"."id" = ?  [["id", 8]]

    def set_lost_animal
      @lost_animal = LostAnimal.find(params[:id])
---
SELECT  "lost_animals".* FROM "lost_animals" WHERE "lost_animals"."id" = ? LIMIT 1  [["id", 8]]