missing-paws/app/controllers/pet_academies_controller.rb

  def index
    @pet_academy = PetAcademy.all
---
SELECT "pet_academies".* FROM "pet_academies"

  def create

     @vet_center = current_user.pet_academy.build(pet_shop_params)


    respond_to do |format|
      if @pet_academy.save
---
INSERT INTO "pet_academies" ("title", "description", "image_url", "phone", "website", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_pet_academy
      @pet_academy = PetAcademy.find(params[:id])
---
SELECT  "pet_academies".* FROM "pet_academies" WHERE "pet_academies"."id" = ? LIMIT 1  [["id", 1]]