missing-paws/app/controllers/pet_shops_controller.rb

SELECT "pet_shops".* FROM "pet_shops"
---
  def index
    @pet_shops = PetShop.all

INSERT INTO "pet_shops" ("title", "description", "image_url", "phone", "website", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

   @pet_shops = current_user.pet_shops.build(pet_shop_params)

    respond_to do |format|
      if @pet_shop.save

SELECT  "pet_shops".* FROM "pet_shops" WHERE "pet_shops"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_pet_shop
      @pet_shop = PetShop.find(params[:id])