missing-paws/app/controllers/pet_hotels_controller.rb

SELECT "pet_hotels".* FROM "pet_hotels"
---
  def index
    @pet_hotel = PetHotel.all

INSERT INTO "pet_hotels" ("title", "description", "image_url", "phone", "website", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @pet_hotel = PetHotel.new(pet_hotel_params)

    respond_to do |format|
      if @pet_hotel.save

SELECT  "pet_hotels".* FROM "pet_hotels" WHERE "pet_hotels"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_pet_hotel
      @pet_hotel = PetHotel.find(params[:id])