missing-paws/app/controllers/topics_controller.rb

  def index
    if params[:search]
      @topics = Topic.search(params[:search]).order("created_at DESC")
---
SELECT "topics".* FROM "topics"  ORDER BY created_at DESC

  def update
    respond_to do |format|
      if @topic.update(topic_params)
---
UPDATE "topics" SET "title" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["title", "Persian2"], ["updated_at", "2015-08-17 14:31:44.076871"], ["id", 3]]

    def set_topic
      @topic = Topic.find(params[:id])
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 3]]