missing-paws/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Anton"], ["updated_at", "2015-08-17 13:07:39.856542"], ["id", 3]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)