missing-paws/app/controllers/vet_centers_controller.rb

  def index
    @vet_centers = VetCenter.all
---
SELECT "vet_centers".* FROM "vet_centers"

  def create
    @vet_center = VetCenter.new(vet_center_params)

    respond_to do |format|
      if @vet_center.save
---
INSERT INTO "vet_centers" ("title", "description", "image_url", "phone", "website", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_vet_center
      @vet_center = VetCenter.find(params[:id])
---
SELECT  "vet_centers".* FROM "vet_centers" WHERE "vet_centers"."id" = ? LIMIT 1  [["id", 1]]