missing-paws/app/views/home/index.html.erb

<div class="row">
  <% stories = Story.all%>
---
SELECT "stories".* FROM "stories"